// 8. Реализуйте класс Сonversion, сдержащий 
// метод ToBinaryNumber, преобразующий все числа 10 системы счисления в 2, 
// метод ToHexadecimalNumber, преобразующий все числа 10 системы счисления в 16, 
// метод ToOctalNumber, преобразующий все числа 10 системы счисления в 8

// 9. Реализуйте класс Сonversion, сдержащий 
// метод ToDecimalNumber, преобразующий все числа 2 системы счисления в 10, 
// метод ToHexadecimalNumber, преобразующий все числа 2 системы счисления в 16,
// метод ToOctalNumber, преобразующий все числа 2 системы счисления в 8

// 10. Реализуйте класс Сonversion, сдержащий
// метод ToDecimalNumber, преобразующий все числа 16 системы счисления в 10,
// метод ToBinaryNumber, преобразующий все числа 16 системы счисления в 2,